Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1299KCZAD.svd
        <register>
          <name>HB16TIME4</name>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x0000031C</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16TIME4_RDWSM</name>
              <description>CS3n Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME4_WRWSM</name>
              <description>CS3n Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME4_CAPWIDTH</name>
              <description>CS3n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME4_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME4_IRDYDLY</name>
              <description>CS3n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HBPSRAM</name>
          <description>EPI Host-Bus PSRAM</description>
          <addressOffset>0x00000360</addressOffset>
          <fields>
            <field>
              <name>EPI_HBPSRAM_CR</name>
              <description>PSRAM Config Register</description>
              <bitRange>[20:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER6</name>
      <prependToName>TIMER6</prependToName>
      <baseAddress>0x400E0000</baseAddress>
      <interrupt><name>TIMER6A</name><value>98</value></interrupt>
      <interrupt><name>TIMER6B</name><value>99</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER7</name>
      <prependToName>TIMER7</prependToName>
      <baseAddress>0x400E1000</baseAddress>
      <interrupt><name>TIMER7A</name><value>100</value></interrupt>
      <interrupt><name>TIMER7B</name><value>101</value></interrupt>
    </peripheral>
    <peripheral>
      <name>EMAC0</name>
      <description>Register map for EMAC0 peripheral</description>
      <groupName>MAC</groupName>
      <prependToName>EMAC0</prependToName>
      <baseAddress>0x400EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>EMAC0</name><value>40</value></interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>Ethernet MAC Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>EMAC_CFG_PRELEN</name>
              <description>Preamble Length for Transmit Frames</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_CFG_PRELEN_7</name>
                  <description>7 bytes of preamble</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_PRELEN_5</name>
                  <description>5 bytes of preamble</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_PRELEN_3</name>
                  <description>3 bytes of preamble</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_CFG_RE</name>
              <description>Receiver Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_TE</name>
              <description>Transmitter Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_DC</name>
              <description>Deferral Check</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_BL</name>
              <description>Back-Off Limit</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_1024</name>
                  <description>k = min (n,10)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_256</name>
                  <description>k = min (n,8)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_8</name>
                  <description>k = min (n,4)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_2</name>
                  <description>k = min (n,1)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_CFG_ACS</name>
              <description>Automatic Pad or CRC Stripping</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_DR</name>
              <description>Disable Retry</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_IPC</name>
              <description>Checksum Offload</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_DUPM</name>
              <description>Duplex Mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_LOOPBM</name>
              <description>Loopback Mode</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_DRO</name>
              <description>Disable Receive Own</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_FES</name>
              <description>Speed</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_PS</name>
              <description>Port Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_DISCRS</name>
              <description>Disable Carrier Sense During Transmission</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_IFG</name>
              <description>Inter-Frame Gap (IFG)</description>
              <bitRange>[19:17]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_96</name>
                  <description>96 bit times</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_88</name>
                  <description>88 bit times</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_80</name>
                  <description>80 bit times</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_72</name>
                  <description>72 bit times</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_64</name>
                  <description>64 bit times</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_56</name>
                  <description>56 bit times</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_48</name>
                  <description>48 bit times</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_40</name>
                  <description>40 bit times</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_CFG_JFEN</name>
              <description>Jumbo Frame Enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_JD</name>
              <description>Jabber Disable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_WDDIS</name>
              <description>Watchdog Disable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_CST</name>
              <description>CRC Stripping for Type Frames</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EMAC_CFG_TWOKPEN</name>
              <description>IEEE 802</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMEFLTR</name>
          <description>Ethernet MAC Frame Filter</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>EMAC_FRAMEFLTR_PR</name>
              <description>Promiscuous Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_HUC</name>
              <description>Hash Unicast</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_HMC</name>
              <description>Hash Multicast</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_DAIF</name>
              <description>Destination Address (DA) Inverse Filtering</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_PM</name>
              <description>Pass All Multicast</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_DBF</name>
              <description>Disable Broadcast Frames</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_PCF</name>
              <description>Pass Control Frames</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_ALL</name>
                  <description>The MAC filters all control frames from reaching application</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_PAUSE</name>
                  <description>MAC forwards all control frames except PAUSE control frames to application even if they fail the address filter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_NONE</name>
                  <description>MAC forwards all control frames to application even if they fail the address Filter</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_ADDR</name>
                  <description>MAC forwards control frames that pass the address Filter</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_SAIF</name>
              <description>Source Address (SA) Inverse Filtering</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_SAF</name>
              <description>Source Address Filter Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_HPF</name>
              <description>Hash or Perfect Filter</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_VTFE</name>
              <description>VLAN Tag Filter Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_RA</name>
              <description>Receive All</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHTBLH</name>
          <description>Ethernet MAC Hash Table High</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>EMAC_HASHTBLH_HTH</name>
              <description>Hash Table High</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHTBLL</name>
          <description>Ethernet MAC Hash Table Low</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>EMAC_HASHTBLL_HTL</name>
              <description>Hash Table Low</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIIADDR</name>
          <description>Ethernet MAC MII Address</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>EMAC_MIIADDR_MIIB</name>
              <description>MII Busy</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_MIIADDR_MIIW</name>
              <description>MII Write</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_MIIADDR_CR</name>
              <description>Clock Reference Frequency Selection</description>
              <bitRange>[5:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_60_100</name>
                  <description>The frequency of the System Clock is 60 to 100 MHz providing a MDIO clock of SYSCLK/42</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_100_150</name>
                  <description>The frequency of the System Clock is 100 to 150 MHz providing a MDIO clock of SYSCLK/62</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_20_35</name>
                  <description>The frequency of the System Clock is 20-35 MHz providing a MDIO clock of System Clock/16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_35_60</name>
                  <description>The frequency of the System Clock is 35 to 60 MHz providing a MDIO clock of System Clock/26</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_MIIADDR_MII</name>
              <description>MII Register</description>
              <bitRange>[10:6]</bitRange>
            </field>
            <field>
              <name>EMAC_MIIADDR_PLA</name>
              <description>Physical Layer Address</description>
              <bitRange>[15:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIIDATA</name>
          <description>Ethernet MAC MII Data Register</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EMAC_MIIDATA_DATA</name>
              <description>MII Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLOWCTL</name>
          <description>Ethernet MAC Flow Control</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>EMAC_FLOWCTL_FCBBPA</name>
              <description>Flow Control Busy or Back-pressure Activate</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_FLOWCTL_TFE</name>
              <description>Transmit Flow Control Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_FLOWCTL_RFE</name>
              <description>Receive Flow Control Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_FLOWCTL_UP</name>
              <description>Unicast Pause Frame Detect</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_FLOWCTL_PLT</name>
              <description>Pause Low Threshold</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_FLOWCTL_PLT_4</name>
                  <description>The threshold is Pause time minus 4 slot times (PT - 4 slot times)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FLOWCTL_PLT_28</name>
                  <description>The threshold is Pause time minus 28 slot times (PT - 28 slot times)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FLOWCTL_PLT_144</name>
                  <description>The threshold is Pause time minus 144 slot times (PT - 144 slot times)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FLOWCTL_PLT_156</name>
                  <description>The threshold is Pause time minus 256 slot times (PT - 256 slot times)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_FLOWCTL_DZQP</name>
              <description>Disable Zero-Quanta Pause</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_FLOWCTL_PT</name>
              <description>Pause Time</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VLANTG</name>
          <description>Ethernet MAC VLAN Tag</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>EMAC_VLANTG_VL</name>
              <description>VLAN Tag Identifier for Receive Frames</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_VLANTG_ETV</name>
              <description>Enable 12-Bit VLAN Tag Comparison</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_VLANTG_VTIM</name>
              <description>VLAN Tag Inverse Match Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EMAC_VLANTG_ESVL</name>
              <description>Enable S-VLAN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EMAC_VLANTG_VTHM</name>
              <description>VLAN Tag Hash Table Match Enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
