Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1299KCZAD.svd
        <register>
          <name>MEMTIM0</name>
          <description>Memory Timing Parameter Register 0 for Main Flash and EEPROM</description>
          <addressOffset>0x000000C0</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MEMTIM0_FWS</name>
              <description>Flash Wait State</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_FBCE</name>
              <description>Flash Bank Clock Edge</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_FBCHT</name>
              <description>Flash Bank Clock High Time</description>
              <bitRange>[9:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_0_5</name>
                  <description>1/2 system clock period</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_1</name>
                  <description>1 system clock period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_1_5</name>
                  <description>1.5 system clock periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_2</name>
                  <description>2 system clock periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_2_5</name>
                  <description>2.5 system clock periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_3</name>
                  <description>3 system clock periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_3_5</name>
                  <description>3.5 system clock periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_4</name>
                  <description>4 system clock periods</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_4_5</name>
                  <description>4.5 system clock periods</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_EWS</name>
              <description>EEPROM Wait States</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_EBCE</name>
              <description>EEPROM Bank Clock Edge</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_EBCHT</name>
              <description>EEPROM Clock High Time</description>
              <bitRange>[25:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_0_5</name>
                  <description>1/2 system clock period</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_1</name>
                  <description>1 system clock period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_1_5</name>
                  <description>1.5 system clock periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_2</name>
                  <description>2 system clock periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_2_5</name>
                  <description>2.5 system clock periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_3</name>
                  <description>3 system clock periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_3_5</name>
                  <description>3.5 system clock periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_4</name>
                  <description>4 system clock periods</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_4_5</name>
                  <description>4.5 system clock periods</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTCLKCFG</name>
          <description>Alternate Clock Configuration</description>
          <addressOffset>0x00000138</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_ALTCLKCFG_ALTCLK</name>
              <description>Alternate Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_ALTCLKCFG_ALTCLK_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_ALTCLKCFG_ALTCLK_RTCOSC</name>
                  <description>Hibernation Module Real-time clock output (RTCOSC)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_ALTCLKCFG_ALTCLK_LFIOSC</name>
                  <description>Low-frequency internal oscillator (LFIOSC)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSCLKCFG</name>
          <description>Deep Sleep Clock Configuration Register</description>
          <addressOffset>0x00000144</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DSCLKCFG_DSSYSDIV</name>
              <description>Deep Sleep Clock Divisor</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DSCLKCFG_DSOSCSRC</name>
              <description>Deep Sleep Oscillator Source</description>
              <bitRange>[23:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_LFIOSC</name>
                  <description>LFIOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_MOSC</name>
                  <description>MOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_RTC</name>
                  <description>Hibernation Module RTCOSC</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSCLKCFG_MOSCDPD</name>
              <description>MOSC Disable Power Down</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DSCLKCFG_PIOSCPD</name>
              <description>PIOSC Power Down</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVSCLK</name>
          <description>Divisor and Source Clock Configuration</description>
          <addressOffset>0x00000148</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DIVSCLK_DIV</name>
              <description>Divisor Value</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DIVSCLK_SRC</name>
              <description>Clock Source</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DIVSCLK_SRC_SYSCLK</name>
                  <description>System Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DIVSCLK_SRC_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DIVSCLK_SRC_MOSC</name>
                  <description>MOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DIVSCLK_EN</name>
              <description>DIVSCLK Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPROP</name>
          <description>System Properties</description>
          <addressOffset>0x0000014C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SYSPROP_FPU</name>
              <description>FPU Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCCAL</name>
          <description>Precision Internal Oscillator Calibration</description>
          <addressOffset>0x00000150</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCCAL_UT</name>
              <description>User Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UPDATE</name>
              <description>Update Trim</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_CAL</name>
              <description>Start Calibration</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UTEN</name>
              <description>Use User Trim Value</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCSTAT</name>
          <description>Precision Internal Oscillator Statistics</description>
          <addressOffset>0x00000154</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCSTAT_CT</name>
              <description>Calibration Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_CR</name>
              <description>Calibration Result</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRNONE</name>
                  <description>Calibration has not been attempted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRPASS</name>
                  <description>The last calibration operation completed to meet 1% accuracy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRFAIL</name>
                  <description>The last calibration operation failed to meet 1% accuracy</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_DT</name>
              <description>Default Trim Value</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ0</name>
          <description>PLL Frequency 0</description>
          <addressOffset>0x00000160</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLFREQ0_MINT</name>
              <description>PLL M Integer Value</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ0_MFRAC</name>
              <description>PLL M Fractional Value</description>
              <bitRange>[19:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ0_PLLPWR</name>
              <description>PLL Power</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ1</name>
          <description>PLL Frequency 1</description>
          <addressOffset>0x00000164</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLFREQ1_N</name>
              <description>PLL N Value</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ1_Q</name>
              <description>PLL Q Value</description>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLSTAT</name>
          <description>PLL Status</description>
          <addressOffset>0x00000168</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLSTAT_LOCK</name>
              <description>PLL Lock</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPPWRCFG</name>
          <description>Sleep Power Configuration</description>
          <addressOffset>0x00000188</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SLPPWRCFG_SRAMPM</name>
              <description>SRAM Power Modes</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_SRAMPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_SRAMPM_SBY</name>
                  <description>Standby Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_SRAMPM_LP</name>
                  <description>Low Power Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_SLPPWRCFG_FLASHPM</name>
              <description>Flash Power Modes</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_FLASHPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_FLASHPM_SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSLPPWRCFG</name>
          <description>Deep-Sleep Power Configuration</description>
          <addressOffset>0x0000018C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DSLPPWRCFG_SRAMPM</name>
              <description>SRAM Power Modes</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_SRAMPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_SRAMPM_SBY</name>
                  <description>Standby Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_SRAMPM_LP</name>
                  <description>Low Power Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPPWRCFG_FLASHPM</name>
              <description>Flash Power Modes</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_FLASHPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_FLASHPM_SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPPWRCFG_TSPD</name>
              <description>Temperature Sense Power Down</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DSLPPWRCFG_LDOSM</name>
              <description>LDO Sleep Mode</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSTAT</name>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_NVMSTAT_FWB</name>
              <description>32 Word Flash Write Buffer Available</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOSPCTL</name>
          <description>LDO Sleep Power Control</description>
          <addressOffset>0x000001B4</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDOSPCTL_VLDO</name>
              <description>LDO Output Voltage</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_LDOSPCTL_VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
